{
  "routes": {
    "projects": "Projects",
    "experience": "Experience",
    "contact": "Contact"
  },
  "home": {
    "welcome": "Hello there🖐, my name is ",
    "name": "Hubert",
    "description": "I'm a passionate IT student at the crossroads of creativity and technology, diving deep into the world of Web Development and Software Engineering. With a keen eye for detail and a relentless drive to innovate, I'm on a mission to craft seamless digital experiences and robust software solutions. Explore my portfolio to witness my journey through coding challenges, collaborative projects, and my continuous quest for learning and growth in the tech arena.",
    "courses": "Courses",
    "education": "Education",
    "university": "Warsaw University of Life Science",
    "major": "Computer Science",
    "degree": "Bachelor",
    "present": "Present"
  },
  "contact": {
    "contact": "Contact"
  },
  "projects": {
    "projects": "Projects",
    "stack": "Stack",
    "repoLink": "Repository link",
    "descriptions": "Interactive and responsive web menu application for a restaurant using React.js, Express.js, and MongoDB. Implemented key features including dynamic product listings, cart management, order processing with RESTful API, and client-side state management using Redux Toolkit. Enhanced user experience through efficient navigation and real-time feedback mechanisms.;URL shortener service written in Go. This project uses the Gin web framework to create a RESTful API that shortens URLs and redirects users to the original URL when they visit the shortened link. The application also uses MongoDB to store and retrieve the original URLs and their corresponding shortened versions. Docker is used to containerize the application for easy deployment and scaling.;The site you are currently viewing.;RESTful API in Go, serving as the backend for a dynamic web application. Implemented key features including user authentication, data persistence, and real-time data processing. Utilized Docker for seamless deployment and scaling.;Fun and interactive word puzzle game built with React. This clone of the popular Wordle game offers a sleek user interface and engaging gameplay, all developed using modern web technologies.;Full-fledged Content Management System using PHP. This comprehensive project includes sophisticated features such as user registration and authentication, product management and an integrated shopping cart, all supported by a MySQL database. It also contains single-handedly developed front-end,  Bootstrap to ensure a responsive and intuitive user interface."
  },
  "experience": {
    "experience": "Experience",
    "at": "at",
    "technologies": "Technologies",
    "description": "Description",
    "duties": "Database administration and design;Business requirements analysis;Designing and implementing Siebel CRM solutions;Scripting and user interfaces development;Testing and optimization;Writing technical documentation;Agile scrum methodology, Jira;System updates and enhancements"
  }
}
