{
  "routes": {
    "projects": "Projekty",
    "experience": "Dowiadczenie",
    "contact": "Kontakt"
  },
  "home": {
    "welcome": "Witaj, nazywam si ",
    "name": "Hubert",
    "description": "Jestem pasjonatem informatyki, kt贸ry czy kreatywno z technologi, zagbiajc si w wiat webdevu i in偶ynierii oprogramowania. Zawsze zwracam uwag na szczeg贸y. Moim celem jest tworzenie innowacyjnych i solidnych rozwiza programistycznych. Zapraszam do obejrzenia mojego portfolio, gdzie zobaczysz moj drog przez wyzwania zwizane z kodowaniem, projekty zespoowe oraz cig ch nauki i rozwoju w bran偶y IT.",
    "courses": "Kursy",
    "education": "Edukacja",
    "university": "Szkoa G贸wna Gospodarstwa Wiejskiego",
    "major": "Informatyka",
    "degree": "In偶ynier",
    "present": "Obecnie"
  },
  "contact": {
    "contact": "Kontakt"
  },
  "projects": {
    "projects": "Projekty",
    "stack": "U偶yto",
    "repoLink": "Link do repozytorium",
    "descriptions": "Interaktywna i responsywna aplikacja menu dla restauracji z wykorzystaniem React.js, Express.js i MongoDB. Zaimplementowano kluczowe funkcje, takie jak dynamiczne listy produkt贸w, zarzdzanie koszykiem, przetwarzanie zam贸wie za pomoc RESTful API oraz zarzdzanie stanem po stronie klienta przy u偶yciu Redux Toolkit. Poprawiono dowiadczenie u偶ytkownika poprzez efektywn nawigacj i mechanizmy informacyjne na czas rzeczywisty.;Serwis skracania adres贸w URL napisany w Go. Projekt ten wykorzystuje framework internetowy Gin do utworzenia RESTful API, kt贸re skraca adresy URL i przekierowuje u偶ytkownik贸w do oryginalnego adresu URL, gdy odwiedz skr贸cony link. Aplikacja korzysta r贸wnie偶 z MongoDB do przechowywania i pobierania oryginalnych adres贸w URL i ich odpowiadajcych im skr贸conych wersji. Docker jest u偶ywany do skonteneryzowania aplikacji w celu atwego wdra偶ania i skalowania.;Strona, kt贸r obecnie przegldasz.;RESTful API w Go, su偶ce jako backend dla dynamicznej aplikacji internetowej. Zaimplementowano kluczowe funkcje, takie jak uwierzytelnianie u偶ytkownika, trwao danych i przetwarzanie danych w czasie rzeczywistym. Wykorzystano Docker do bezproblemowego wdra偶ania i skalowania.;Zabawna i interaktywna gra sowna zbudowana w React. Ten klon popularnej gry Wordle oferuje elegancki interfejs u偶ytkownika i anga偶ujc rozgrywk, wszystko opracowane przy u偶yciu nowoczesnych technologii internetowych.;Penoprawny system zarzdzania treci przy u偶yciu PHP. Ten wszechstronny projekt zawiera zaawansowane funkcje, takie jak rejestracja i uwierzytelnianie u偶ytkownik贸w, zarzdzanie produktami oraz zintegrowany koszyk zakupowy, wszystko to wspierane przez baz danych MySQL. Zawiera r贸wnie偶 samodzielnie opracowany front-end, u偶ywajcy Bootstrap do zapewnienia responsywnego i intuicyjnego interfejsu u偶ytkownika."
  },
  "experience": {
    "experience": "Dowiadczenie",
    "at": "w",
    "technologies": "Technologie",
    "description": "Opis",
    "duties": "Rozw贸j i implementacja funkcji wewntrznego systemu CRM, poprawa proces贸w biznesowych;Wykorzystanie AWS do zarzdzania infrastruktur i skalowania aplikacji;Integracja CRM z innymi systemami, centralizacja danych;Testowanie i optymalizacja kodu, zapewnienie jakoci i stabilnoci systemu.;;Tworzenie i utrzymywanie interfejsu u偶ytkownika;Budowanie i utrzymywanie serwis贸w backendowych (REST API);Projektowanie, tworzenie oraz optymalizacja struktur danych i zapyta;Pisanie test贸w jednostkowych i integracyjnych"
  }
}
